ch10/ch10-3.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-07-30 Thu 09:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Chapter 10.3</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="pedh" />
<link rel="stylesheet" type="text/css" href="/css/org-info.css" />


</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/CLRS-Solutions"> UP </a>
 |
 <a accesskey="H" href="/CLRS-Solutions"> HOME </a>
</div><div id="content">
<h1 class="title">Chapter 10.3</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7728522">ch10.3</a>
<ul>
<li><a href="#org1bafde6">10.3-1</a></li>
<li><a href="#orgd452a3a">10.3-2</a></li>
<li><a href="#org3e29534">10.3-3</a></li>
<li><a href="#orgcd9a186">10.3-4</a></li>
<li><a href="#org0de9d48">10.3-5</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org7728522" class="outline-2">
<h2 id="org7728522">ch10.3</h2>
<div class="outline-text-2" id="text-org7728522">
</div>
<div id="outline-container-org1bafde6" class="outline-3">
<h3 id="org1bafde6">10.3-1</h3>
<div class="outline-text-3" id="text-org1bafde6">
<pre class="example">
(13, 4, 8, 19, 5, 11) stored as a doubly linked list.

1. using the multiple-array representation
|----------+----+----+---+---+----+---|
| L.head=2 |  1 |  2 | 3 | 4 |  5 | 6 |
|----------+----+----+---+---+----+---|
| next     |  4 |  3 | 6 | 5 |  / | 1 |
|----------+----+----+---+---+----+---|
| key      | 19 | 13 | 4 | 5 | 11 | 8 |
|----------+----+----+---+---+----+---|
| prev     |  6 |  / | 2 | 1 |  4 | 3 |
|----------+----+----+---+---+----+---|

2. using the single-array representation
|---------------+----+----+----+----+---+---|
| L.head=4      |  1 |  2 |  3 |  4 | 5 | 6 |
|---------------+----+----+----+----+---+---|
| key,next,prev | 19 | 10 | 16 | 13 | 7 | / |
|---------------+----+----+----+----+---+---|

|---+----+---+----+----+----|
| 7 |  8 | 9 | 10 | 11 | 12 |
|---+----+---+----+----+----|
| 4 | 16 | 4 |  5 | 13 |  1 |
|---+----+---+----+----+----|

|----+----+----+----+----+----|
| 13 | 14 | 15 | 16 | 17 | 18 |
|----+----+----+----+----+----|
| 11 |  / | 10 |  8 |  1 |  7 |
|----+----+----+----+----+----|
</pre>
</div>
</div>
<div id="outline-container-orgd452a3a" class="outline-3">
<h3 id="orgd452a3a">10.3-2</h3>
<div class="outline-text-3" id="text-orgd452a3a">
<pre class="example">
ALLOCATE-OBJECT()
    if free == NIL
	error "out of space"
    x = free
    free = A[x + 1]
    return x

FREE-OBJECT(x)
    A[x + 1] = free
    free = x
</pre>
</div>
</div>
<div id="outline-container-org3e29534" class="outline-3">
<h3 id="org3e29534">10.3-3</h3>
<div class="outline-text-3" id="text-org3e29534">
<p>
We don't need to set or reset the <code>prev</code> attributes of objects, because the
free list works like a stack, i.e. a singly linked list.
</p>
</div>
</div>
<div id="outline-container-orgcd9a186" class="outline-3">
<h3 id="orgcd9a186">10.3-4</h3>
<div class="outline-text-3" id="text-orgcd9a186">
<pre class="example">
ALLOCATE-OBJECT()
    PUSH(S, NIL)
    return S.top

FREE-OBJECT(x)
    for i = x to S.top - 1
	S[i] = S[i + 1]
    S.top = S.top - 1
</pre>
</div>
</div>
<div id="outline-container-org0de9d48" class="outline-3">
<h3 id="org0de9d48">10.3-5</h3>
<div class="outline-text-3" id="text-org0de9d48">
<pre class="example">
COMPACTIFY-LIST(L, F)
    cur = L.head
    if cur != NIL
	L.head = 1
    i = 1
    while cur != NIL
	if cur != i
	    if F.head = i
		 F.head = cur
	    if next[cur] != NIL
		prev[next[cur]] = i
	    if prev[cur] != NIL
		next[prev[cur]] = i
	    if next[i] != NIL
		prev[next[i]] = cur
	    if prev[i] != NIL
		next[prev[i]] = cur
	    exchange key[cur] with key[i]
	    exchange next[cur] with next[i]
	    exchange prev[cur] with prev[i]
	cur = next[i]
	i = i + 1
</pre>
<p>
After the procedure is done, the items in \(L\) occupy array positions
\(1,2,...,n\), and we only used <code>exchange</code> to move items, thus the items in
\(F\) occupy the rest of the array positions \(n+1,n+2...m\).
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: pedh</p>
<p class="date">Created: 2020-07-30 Thu 09:59</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
